apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# The socket's receive queue, in datagrams. IDF defaults to 6 and the boot
# banner prints it as `udp mbox: 6`.
#
# Raised on the satellite first, where the case was obvious: one socket taking
# ~136 datagrams a second through a six-deep queue is 44 ms of headroom, and
# whatever lwIP cannot hand over in 44 ms it discards silently.
#
# The hub's case is quieter and slower to see, which is why it was nearly left
# alone. This socket carries only time probes and splice reports -- four probes
# a second per satellite -- so at one satellite six deep is 1.5 s of slack and
# nothing could plausibly overflow it.
#
# It does not stay that way. The rate scales with the floor: at MAX_CLIENTS = 8
# it is 32 datagrams a second and under 200 ms of headroom, from eight units
# free-running on independent 250 ms timers whose probes will sometimes arrive
# together. probe_task serves this socket at priority 6, below playback and the
# sync monitor.
#
# What makes it worth the bytes rather than merely tidy is the FAILURE MODE. A
# probe lost in this queue is indistinguishable from a satellite that stopped
# probing, and CLIENT_TIMEOUT_US is 2 s -- eight probes. Lose enough and the hub
# forgets a satellite that is sitting right there, drops it from the send list,
# and stops sending it audio until its next probe gets through. That is a silent
# speaker, reported as sta-timeout, and no counter anywhere would say the
# difference.
#
# 32 matches the satellite, so there is one number for this on the floor rather
# than two.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32

# 50% overlap between analysis windows. The window stays 1024; this is only how
# far the analysis advances between them.
#
# Pinned here for the reason it is pinned on the classic hub and on the
# satellite: a hop mismatch across a floor is the expensive bug, and this build
# makes one MORE likely rather than less, because it is the first unit on the
# floor whose config is not a copy of the others'. Both flux floors and the beat
# history were swept against 206 recordings at 512 -- see docs/tuning-corpus.md.
CONFIG_DANCEFLOOR_LED_HOP_512=y

# The pattern the floor runs, which is a floor-wide agreement and not a per-unit
# preference: two units on different patterns are not comparable by eye, and the
# eye is the only instrument most of this project has.
#
# Pinned here for the same reason the hop above is, and this build is the one
# that proved the reason. The Kconfig default is "pulse"; this floor runs
# "boom"; sdkconfig is gitignored, so the "boom" on the classic hub and the
# satellite lived only in untracked files and did not come across. The first S3
# hub therefore came up cycling a 28-second hue against its neighbours' fixed
# amber, and the immediate reading of that was a sync fault.
#
# Cheaper than a hop mismatch, which is invisible -- this one is obvious the
# moment the strips are side by side. It is still worth a tracked line, because
# what it looks like is the expensive thing rather than what it is.
CONFIG_DANCEFLOOR_LED_PATTERN="boom"

# ---------------------------------------------------------------------------
# Pin map: Seeed Studio XIAO ESP32-S3 (Sense)
# ---------------------------------------------------------------------------
#
# The board breaks out eleven GPIOs, D0-D10, and nothing else:
#
#   D0=1  D1=2  D2=3  D3=4  D4=5  D5=6  D6=43(TX)  D7=44(RX)
#   D8=7(SCK)  D9=8(MISO)  D10=9(MOSI)
#
# The hub wants seven of them, so the map below is not one arrangement among
# many -- it is close to the only one. D6 is the console UART TX (see the top of
# this file); what is left over after that is D1, D2 and D5.
#
# None of the classic hub's numbers carry over except the marker. 23 and 25 do
# not exist on this part; 26 and 27 do, but are wired to the SPI flash.
#
# On the Sense variant the camera and PDM microphone hang off the B2B connector
# on GPIOs that are not broken out (the mic is 42/41), so they take nothing from
# this list. The SD slot may: it is reportedly on the same D8/D9/D10 SPI pads
# the I2S output uses below, with GPIO 21 for CS. Unverified against the
# schematic, and irrelevant unless you want the card -- but do not assume the
# two coexist without checking.
#
# None of it gives anything either. Every one of them is dead weight for a hub,
# which analyses the synchronised stream and deliberately never listens to a
# room (architecture.md S12).

# I2S to the PCM5102A, on the three SPI-labelled pads so the DAC is one ribbon
# off the end of the header. This chip is the I2S master.
CONFIG_DANCEFLOOR_I2S_BCK_PIN=7
CONFIG_DANCEFLOOR_I2S_LRCK_PIN=8
CONFIG_DANCEFLOOR_I2S_DATA_PIN=9

# Four wires in from the bridge chip, on SPI3 -- SPI2 is the LED strip.
#
# SCK keeps D7, the pad this link used to arrive on as a UART, so one lead of
# the old wiring survives. The other three take what was left: D5 and D2 were
# genuinely spare, and D4 was not.
#
# D4 = GPIO 5 was DANCEFLOOR_MONITOR_GPIO, and taking it ends the marker/monitor
# instrument for good, because that needs GPIO 4 AND GPIO 5 and only one of them
# survives. Four pads had to come from somewhere and this was the cheapest of
# them: the instrument is off (DANCEFLOOR_ENABLE_MARKER defaults to n), it needs
# a wire between two boards that a deployed floor cannot have, and nothing in
# either firmware corrects on it. TRACK DIVERGENCE over WiFi is untouched and
# covers every satellite rather than the one on the bench.
#
# The alternative was D1 = GPIO 2, the LED sync marker, which is enabled in this
# build and is the check that needs no console at all. Keeping a working
# instrument beat keeping a disabled one.
#
# The handshake is the OUTPUT of the four, and it is on D2 = GPIO 3 for that
# reason: 3 is this part's JTAG_SEL strapping pin -- inert unless the
# STRAP_JTAG_SEL eFuse is burned -- and a pin this board drives itself is a
# safer thing to put there than one the bridge is driving while we boot.
CONFIG_DANCEFLOOR_SBC_SPI_SCK_PIN=44
CONFIG_DANCEFLOOR_SBC_SPI_MOSI_PIN=6
CONFIG_DANCEFLOOR_SBC_SPI_CS_PIN=5
CONFIG_DANCEFLOOR_SBC_SPI_HS_PIN=3

# WS2812 data, still via the 74AHCT125 -- the S3 drives 3.3 V exactly as the
# classic ESP32 does, so the level shifter is no less necessary here. Driven
# through SPI2_HOST and the GPIO matrix, which is fine at the ~2.4 MHz the
# WS2812 encoding needs. Never RMT: see architecture.md S12.
CONFIG_DANCEFLOOR_LED_GPIO=1

