apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# gpio_set_level() into IRAM, for the SBC link's handshake.
#
# The two spi_slave callbacks that raise and drop the handshake are IRAM_ATTR
# because they run in interrupt context, and without this that attribute is
# decoration: the callback is in IRAM and the one function it calls is not.
# IDF defaults this off and the cost is a few hundred bytes of IRAM.
#
# It does not make the handshake work with the flash cache disabled -- the
# spi_slave ISR is registered without ESP_INTR_FLAG_IRAM, so a flash write
# defers the interrupt rather than taking it, and the handshake drops late. That
# is the bridge's 100 ms timeout's problem, and it counts what it refuses.
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# The LED sync marker, on D1 = GPIO 2, which the Kconfig already defaults to.
#
# Tracked here rather than left to menuconfig because it was ON in this board's
# untracked sdkconfig and was lost the moment that file was regenerated -- the
# same way the "boom" pattern below was lost, for the same reason, and this file
# already carries a paragraph about that. A bench instrument nobody can find the
# switch for is one nobody uses.
#
# It also earned its place in the pin argument above: the four SPI pads were
# chosen to keep this working, and a setting that decided a pin allocation
# should not live somewhere a rebuild can drop it.
CONFIG_DANCEFLOOR_ENABLE_LED_MARKER=y

# The bench marker pins are NOT set here, on purpose.
#
# DANCEFLOOR_MARKER_GPIO and DANCEFLOOR_MONITOR_GPIO both depend on
# DANCEFLOOR_ENABLE_MARKER, which is off, so they are invisible when this file
# is applied and any value given for them here is silently discarded. Enabling
# the marker later would then fall back to the Kconfig defaults -- and the
# classic hub's monitor pin, 21, is this board's onboard LED rather than a pad.
#
# The marker stays at 4 (D3), which is the one number that survived the move.
# The monitor default is 5 (D4), set in main/Kconfig.projbuild where it cannot
# be dropped.
#
# DANCEFLOOR_LED_MARKER_GPIO lives in the shared components/dancefloor_leds/
# Kconfig and needs nothing here either. Its default is 2, which on this board
# is pad D1 -- free, not a strapping pin, and in range. Wire an LED and a 330 R
# resistor to ground there.
#
# Do NOT point it at 21. That is documented as the onboard user LED and this
# file used to recommend it; it has since been seen not to light at all. Two
# candidate reasons, neither confirmed: the LED may not be on 21 on every board
# revision, and 21 is also the pin the Sense's SD slot reportedly uses for CS.
# It is active low as well, so even working it would read inverted against every
# other unit. An external LED on D1 avoids all three questions.

# ---------------------------------------------------------------------------
# Carried over, but NOT carried over on evidence
# ---------------------------------------------------------------------------
#
# Keep the lwIP tcpip thread off the core the LED tasks run on.
#
# On the classic hub this was the whole fix for render starvation: wake overshoot
# mean 2057 -> 634 us, pattern arithmetic max 23226 -> 5254 us, late frames
# 10 -> 0. Both parts of that reasoning still hold in principle -- the thread
# still runs at priority 18, above every task this firmware creates, core locking
# is still off so every sendto() blocks in that thread rather than in the caller,
# and this unit still drives ~30x the priority-18 work a satellite does.
#
# What does NOT carry over is the measurement. Those numbers were taken on a
# 240 MHz LX6 with esp-dsp's generic FFT; this is an LX7 with the SIMD path, and
# the starvation may be smaller, absent, or differently shaped. It is set here
# because it was right there and is unlikely to hurt, which is exactly the
# standard architecture.md's postscript says produced most of the wasted effort
# in this project.
#
# Before trusting it, run it both ways and read the vis log line. That is a
# measurement nobody has made on this part.
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y

# ---------------------------------------------------------------------------
# Deliberately NOT set
# ---------------------------------------------------------------------------
#
# PSRAM. Still not used for anything by default -- see the note below the
# switches, which is the one that matters.
#
# The old note here said "turn it on only with a specific allocation in mind".
# There is now exactly one: a TFLM tensor arena, which is the one buffer in this
# project that is large, touched only by a low-priority task on the other core,
# and useless to shrink. Everything that note refused is still refused.
#
# It is NOT for the ring. PSRAM is the wrong memory for a ring regardless, since
# the ring is touched from the playback path and cache misses there are the one
# thing that loop cannot absorb.
#
# It is NOT for the lead. The ring that bounds LEAD + RESYNC is the SATELLITE's,
# and the satellite is a classic ESP32 with no PSRAM at all -- so no amount of
# memory on this unit buys the lead a single millisecond. That is the whole
# answer to "the S3 has plenty of PSRAM, can we not have a 500 ms lead": a 500 ms
# lead needs ~107 kB of satellite ring against a largest free block of 106 kB,
# and it would fail to allocate on the board that has to hold it.
#
# The larger ring the wart actually wanted has since been taken, in the
# satellite's internal SRAM, where it belongs: 64 -> 80 kB, which moved the
# bound from 320 ms against 372 to 350 against 464 and let RESYNC_US go from
# 120 to 150.
#
# The octal interface eats GPIO 33-37, which are not broken out on the XIAO, so
# that costs nothing here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# THE line, and the reason enabling PSRAM at all is safe here.
#
# CAPS_ALLOC means ordinary malloc() NEVER returns PSRAM. Nothing that exists
# today moves; the ring, the DMA buffers, the frame queue, the WiFi buffers and
# every stack stay exactly where they are, in internal SRAM, with exactly the
# timing they were measured with. PSRAM is reachable only by asking for it by
# name -- heap_caps_malloc(n, MALLOC_CAP_SPIRAM) -- which in this tree is done
# in one place, ml_arena.c, for the tensor arena and nothing else.
#
# The alternative, SPIRAM_USE_MALLOC, would let the allocator hand PSRAM to
# anything above a threshold, which is precisely the "adds cache-miss jitter to
# every task" the old note warned about. That warning was right and this setting
# is how it is respected rather than overruled.
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Read the vis `cost:` line and the HEALTH heap figures after flipping this on,
# and compare against the numbers recorded above: analysis 3900/21000 us
# mean/max, hub min heap ~68 kB, 0 audio gaps/min over 18 min. The old note
# asked for exactly this measurement and recorded that nobody had made it on
# this part. It is still worth making -- enabling the PSRAM controller changes
# cache behaviour even when nothing allocates from it.

# Forward this unit's logs and HEALTH snapshots over the sync socket to a
# laptop collector (see CONFIG_DANCEFLOOR_WIFI_LOGS). Bench only -- off in a
# production flash, where the shipper compiles out entirely. The hub also
# relays every satellite's logs to the collector, so this is the one unit that
# must have it on for centralised capture to work.
CONFIG_DANCEFLOOR_WIFI_LOGS=y
